// for (let i = 1; i <= 5; i++) {
//     console.log('*****');
// }
// -------------------------------------------------------

// print ได้แถวละครั้ง , print ได้ทีละ *
// string concat

// let str = '';
// for (let i = 1; i <= 1; i++) {
//     console.log('#');

//     for (let j = 0; j <= 1; j++) {
//         str = str +"**"
//     }
//     console.log(str);
// }
// -------------------------------------------------------

// let str = '';
// for (let i = 1; i <= 5; i++) {
//     console.log('#');

//     for (let j = 0; j <= 5; j++) {
//         str = str + "*"
//     }
//     console.log(str);
// }
// -------------------------------------------------------

// for (let i = 1; i <= 1; i++) {
//     let str = '';
// for (let j = 1; j <= 4; j++) {
//     str += '*';
//     }
//     console.log(str);
// }
// -------------------------------------------------------

// ให้เขียนโค้ดแสดงรูปดอกจันตามรูปแบบด้านล่าง โดยแสดงผลออกมาใน console

// *
// *	*
// *	*	*
// *	*	*	*

// หมายเหตุ : คำสั่งขึ้นบรรทัดใหม่ใน console ให้ใช้ \n
// let str ="*  \n**  \n***  \n****\n"

let str = '';
for (let i = 1; i <= 4; i++) {
    for (let j = 1; j <= 4; j++) {
        // j = 1,2,3,4
        // i = 1,2,3,4
        if (j <= i) str += '*';
    }
    str += '\n';
}
console.log(str);